# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
from pyspark.sql import SparkSession
from pyspark.sql import functions as F
from pyspark.sql import types as T

spark = SparkSession.builder\
                    .appName('baby')\
                    .getOrCreate()

25/06/17 13:48:36 WARN Utils: Your hostname, kevin-llanos-Type1ProductConfigId resolves to a loopback address: 127.0.1.1; using 192.168.1.92 instead (on interface wlo1)
25/06/17 13:48:36 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/06/17 13:48:36 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

25/06/17 13:48:55 WARN GarbageCollectionMetrics: To enable non-built-in garbage collector(s) List(G1 Concurrent GC), users should configure it(them) to spark.eventLog.gcMetrics.youngGenerationGarbageCollectors or spark.eventLog.gcMetrics.oldGenerationGarbageCollectors

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
import requests
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

get_url = requests.get(url)

with open('data.csv', 'w', encoding='utf-8') as f:
    f.write(get_url.text)

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names = spark.read.csv('data.csv', sep=',', header=True)

baby_names.show()

+-----+-----+---------+----+------+-----+-----+
|  _c0|   Id|     Name|Year|Gender|State|Count|
+-----+-----+---------+----+------+-----+-----+
|11349|11350|     Emma|2004|     F|   AK|   62|
|11350|11351|  Madison|2004|     F|   AK|   48|
|11351|11352|   Hannah|2004|     F|   AK|   46|
|11352|11353|    Grace|2004|     F|   AK|   44|
|11353|11354|    Emily|2004|     F|   AK|   41|
|11354|11355|  Abigail|2004|     F|   AK|   37|
|11355|11356|   Olivia|2004|     F|   AK|   33|
|11356|11357| Isabella|2004|     F|   AK|   30|
|11357|11358|   Alyssa|2004|     F|   AK|   29|
|11358|11359|   Sophia|2004|     F|   AK|   28|
|11359|11360|   Alexis|2004|     F|   AK|   27|
|11360|11361|Elizabeth|2004|     F|   AK|   27|
|11361|11362|   Hailey|2004|     F|   AK|   27|
|11362|11363|     Anna|2004|     F|   AK|   26|
|11363|11364|  Natalie|2004|     F|   AK|   25|
|11364|11365|    Sarah|2004|     F|   AK|   25|
|11365|11366|   Sydney|2004|     F|   AK|   25|
|11366|11367|      Ava|2004|     F|   AK|   23|
|11367|11368|  Trinity|2004|     F|   AK|   22|
|11368|11369|    Haley|2004|     F|   AK|   21|
+-----+-----+---------+----+------+-----+-----+
only showing top 20 rows

25/06/17 13:52:52 WARN CSVHeaderChecker: CSV header does not conform to the schema.
 Header: , Id, Name, Year, Gender, State, Count
 Schema: _c0, Id, Name, Year, Gender, State, Count
Expected: _c0 but found:
CSV file: file:///home/kevin-llanos/Proyectos/pyspark_exercises/06_Stats/US_Baby_Names/data.csv

In [5]:
df = pd.read_csv('data.csv')

df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [6]:
baby_names.show(10)

+-----+-----+--------+----+------+-----+-----+
|  _c0|   Id|    Name|Year|Gender|State|Count|
+-----+-----+--------+----+------+-----+-----+
|11349|11350|    Emma|2004|     F|   AK|   62|
|11350|11351| Madison|2004|     F|   AK|   48|
|11351|11352|  Hannah|2004|     F|   AK|   46|
|11352|11353|   Grace|2004|     F|   AK|   44|
|11353|11354|   Emily|2004|     F|   AK|   41|
|11354|11355| Abigail|2004|     F|   AK|   37|
|11355|11356|  Olivia|2004|     F|   AK|   33|
|11356|11357|Isabella|2004|     F|   AK|   30|
|11357|11358|  Alyssa|2004|     F|   AK|   29|
|11358|11359|  Sophia|2004|     F|   AK|   28|
+-----+-----+--------+----+------+-----+-----+
only showing top 10 rows

25/06/17 14:37:09 WARN CSVHeaderChecker: CSV header does not conform to the schema.
 Header: , Id, Name, Year, Gender, State, Count
 Schema: _c0, Id, Name, Year, Gender, State, Count
Expected: _c0 but found:
CSV file: file:///home/kevin-llanos/Proyectos/pyspark_exercises/06_Stats/US_Baby_Names/data.csv

In [8]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

### Step 6. Is there more male or female names in the dataset?

### Step 7. Group the dataset by name and assign to names

### Step 8. How many different names exist in the dataset?

### Step 9. What is the name with most occurrences?

### Step 10. How many different names have the least occurrences?

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

### Step 13. Get a summary with the mean, min, max, std and quartiles.